home/programs/emacs/config.org
#+TITLE: Org Mode Configuration
#+AUTHOR: h7x4
#+PROPERTY: header-args :emacs-lisp :tangle yes
#+STARTUP: org-startup-folded: t

#+BEGIN_SRC elisp
;;; ~/.emacs.d/config.el -*- lexical-binding: t; -*-
#+END_SRC

* Use-package

#+BEGIN_SRC elisp
; (setq user-emacs-directory (substitute-in-file-name "$HOME/.emacs.d"))

(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)

(package-initialize)
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)
#+END_SRC

* Keybindings

#+BEGIN_SRC elisp
(use-package general
  :config
  (general-evil-setup)

  (general-create-definer leader-key
    ; :states 'normal
    :states 'motion
    :prefix "SPC"
		:non-normal-prefix "C-SPC"))
#+END_SRC

Base keys

g - git
l - lsp
o - org
p - project management
w - multiple cursors

#+BEGIN_SRC elisp
(leader-key
  ""     nil
  "c"   (general-simulate-key "C-c" :which-key "C-c")
  "u"   (general-simulate-key "C-u" :which-key "C-u")
  "x"   (general-simulate-key "C-x" :which-key "C-x")
  
  "m"   '(:ignore t :which-key "mode")
  "mx"  'nil
  
  ;; Help
  "h"   (general-simulate-key "<f1>" :which-key "C-h")
  
  ;; Insert
  "i"   '(:ignore t :which-key "C-h")
  "ix"  'nil

  ;; Package manager
  ;; "p"   '(:ignore t :which-key "packages")
  ;; "pl"  'list-packages

  ;; Quit operations
  "q"	  '(:ignore t :which-key "quit emacs")
  "qq"  'kill-emacs
  "qz"  'delete-frame

  ;; Buffer operations
  "b"   '(:ignore t :which-key "buffer")
  "bb"  'mode-line-other-buffer
  "bk"  'kill-this-buffer
  ;; "bn"  'next-buffer
  ;; "bp"  'previous-buffer
  "bq"  'kill-buffer-and-window
  ;; "bR"  'rename-file-and-buffer
  "br"  'revert-buffer

  ;; Window operations
  "w"   '(:ignore t :which-key "window")
  "wm"  'maximize-window
  "wh"  'split-window-horizontally
  "wg"  'split-window-vertically
  ;; "wu"  'winner-undo
  "ww"  'other-window
  "wk"  'delete-window
  "wD"  'delete-other-windows

  ;; File operations
  "f"   '(:ignore t :which-key "find")
  ; "fc"  'write-file
  ; "fe"  '(:ignore t :which-key "emacs")
  ;; "fed" 'find-user-init-file
  ;; "feR" 'load-user-init-file
  ; "fj"  'dired-jump
  "fl"  'find-file-literally
  ;; "fR"  'rename-file-and-buffer
  "fs"  'save-buffer

  ;; Applications
  "a"   '(:ignore t :which-key "apps")
  "ad"  'dired
  ":"   'shell-command
  ";"   'eval-expression
  "ac"  'calendar
  "oa"  'org-agenda)
#+END_SRC

General keys

#+BEGIN_SRC emacs-lisp
; (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
(general-define-key
  "<escape>" 'keyboard-escape-quit
  "C-o" 'previous-buffer
  "C-p" 'next-buffer)
#+END_SRC

* Essentials
** Basic config
	 
Stop emacs from using dialog windows

#+BEGIN_SRC emacs-lisp
(setq use-dialog-box nil)
#+END_SRC
	  
Save sessions	 

#+BEGIN_SRC emacs-lisp
;; (desktop-save-mode 1)
#+END_SRC

Set spacing

#+BEGIN_SRC emacs-lisp
(setq-default
  tab-width 2
  c-basic-offset 2)
#+END_SRC

Put backup files in emacs.d/temp

#+BEGIN_SRC emacs-lisp
(setq backup-directory-alist
  `(("." . ,(concat user-emacs-directory "/temp"))))
#+END_SRC

** Evil mode

#+BEGIN_SRC elisp
(use-package evil
  :demand t
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)

  :general ; (leader-key
    ; "wh" '(evil-window-left  :which-key "←")
    ; "wj" '(evil-window-down  :which-key "↓")
    ; "wk" '(evil-window-up    :which-key "↑")
    ; "wl" '(evil-window-right :which-key "→")) 
  ([remap evil-ex-search-forward] 'swiper)
  ([remap evil-ex-search-backward] 'swiper-backward)

  :bind (
    ("C-h" . evil-window-left)
    ("C-j" . evil-window-down)
    ("C-k" . evil-window-up)
    ("C-l" . evil-window-right)

    :map evil-insert-state-map
      ("C-g" . evil-normal-state)
      ("C-h" . evil-delete-backward-char-and-join))

  :config

	  ;; :q should kill the current buffer rather than quitting emacs entirely
	  (evil-ex-define-cmd "q" 'kill-this-buffer)
	  ;; Need to type out :quit to close emacs
	  (evil-ex-define-cmd "quit" 'evil-quit)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal)

    (evil-mode 1))
  #+END_SRC
  

#+BEGIN_SRC elisp
(use-package evil-collection
  :after (evil)
  :config
    (evil-collection-init)
    (evil-collection-company-setup))
#+END_SRC

#+BEGIN_SRC elisp
(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines)
  :general (leader-key
    "c" '(evilnc-comment-or-uncomment-lines :which-key "/* */"))
  (general-nmap
    "gc" 'evilnc-comment-operator))
#+END_SRC

Evil escape mode

#+BEGIN_SRC emacs-lisp
;; (use-package evil-escape
;;   :after (evil company)
;;   :diminish evil-escape-mode
;;   :init
;;     (with-eval-after-load 'company
;;      (add-hook 'evil-normal-state-entry-hook #'company-cancel))
;;     (setq evil-escape-key-sequence "jk"
;;          evil-escape-unordered-key-sequence t)
;;   :config
;;   (evil-escape-mode))
#+END_SRC

** Ivy

#+BEGIN_SRC elisp
(use-package ivy

  :bind (
    :map ivy-minibuffer-map
    ("M-j" . ivy-next-line)
    ("M-k" . ivy-previous-line)
    ("M-l" . ivy-alt-done)))
#+END_SRC

Ivy-rich adds extra columns to a few of the Counsel commands to provide more information about each item.

#+BEGIN_SRC elisp
(use-package ivy-rich
  :config (ivy-rich-mode 1))
#+END_SRC

** Counsel

#+BEGIN_SRC elisp
(use-package counsel
  :general (leader-key
    "ff"    '(counsel-find-file :which-key "find file")
    "f SPC" '(counsel-ag :which-key "Ag")
    "ik"    '(counsel-yank-pop :which-key "from kill-ring")
    "bb"    '(counsel-ibuffer :which-key "choose buffer")
    "fe"    '(counsel-flycheck :which-key "find error"))
  
  :bind (("M-x" . counsel-M-x)
         ("C-x b" . counsel-ibuffer)
         ("C-x C-f" . counsel-find-file)
         :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history)))
#+END_SRC

** Org mode

#+BEGIN_SRC emacs-lisp
(use-package org
	:general (leader-key
		"o"   '(:ignore t :which-key "org")
		"oa"  '(org-agenda :which-key "agenda")
		"ox"  '(org-toggle-checkbox :which-key "[X]")
		"oe"  '(org-edit-src-code :which-key "Edit SRC")
		; Insert
		"io"  '(:ignore t :which-key "org")
		"ios" 'org-insert-structure-template)
  :config
	  (setq org-src-tab-acts-natively nil))
#+END_SRC

Improved version of org-bullets

#+BEGIN_SRC emacs-lisp
(use-package org-superstar
  :hook (org-mode-hook . org-superstar-mode)
  :config  
    (setq org-startup-indented t)            ;; Indent according to section
    (setq org-startup-with-inline-images t)) ;; Display images in-buffer by default
#+END_SRC

Evil bindings for org mode

#+BEGIN_SRC emacs-lisp
(use-package evil-org
  :after (evil org)
  :hook
    (org-mode-hook . evil-org-mode)
    (evil-org-mode-hook .  (lambda ()
              (evil-org-set-key-theme '(navigation insert textobjects additional calendar))))
  :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys)

    (setq org-agenda-files '("~/org/agenda.org"))
    (setq org-directory "~/org/"))
#+END_SRC

** Notes	 
*** Project notes
	 
#+BEGIN_SRC emacs-lisp
(defvar notes-folder "~/.emacs.d/notes")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun format-note-path (project-root)
  (concat notes-folder (string-remove-suffix "/" (string-remove-prefix (getenv "HOME") project-root)) ".org"))

(defun get-notes ()
  (interactive)
  (if (projectile-project-p)
	  (let
		  ((note-path (format-note-path (projectile-project-root))))
      (unless (file-exists-p note-path)
			  (when (y-or-n-p (format "%s does not exist. Create it?" note-path))
          (make-directory (file-name-directory note-path) t)
          (make-empty-file note-path)))
      (find-file note-path))
		;; else
    (message "Couldn't find project folder")))

(leader-key
  "fn" '(get-notes :which-key "Get project notes"))
#+END_SRC

