home/programs/emacs/config.org
** Config files

#+BEGIN_SRC emacs-lisp
(setq dotfiles '(
  ("Emacs"           . (concat user-emacs-directory "/config.org"))
  ("Xmonad"          . "$HOME/.xmonad/xmonad.hs")
  ("Xmobar"          . "$XDG_CONFIG_HOME/xmobar/xmobarrc")
  ("Awesome"         . "$XDG_CONFIG_HOME/awesome/rc.lua")
  ("Stalonetray"     . "$HOME/.stalonetrayrc")
  ("Termite"         . "$XDG_CONFIG_HOME/termite/config")
  ("Kitty"           . "$XDG_CONFIG_HOME/kitty/kitty.conf")
  ("Mpd"             . "$XDG_CONFIG_HOME/mpd/mpd.conf")
  ("Ncmpcpp"         . "$HOME/.ncmpcpp/config")
  ("Nnn"             . "$XDG_CONFIG_HOME/nnn/")
  ("TeX-ntnu"        . "$HOME/texmf/tex/latex/local/ntnu.sty")
  ("Tmux"            . "$XDG_CONFIG_HOME/tmux/tmux.conf")
  ("Todo"            . "$HOME/.todo")
  ("Qutebrowser"     . "$XDG_CONFIG_HOME/qutebrowser/config.py")
  ("Vim"             . "$XDG_CONFIG_HOME/nvim/init.lua")
  ("Zsh"             . "$XDG_CONFIG_HOME/zsh/.zshrc")
  ("Config-selector" . "$HOME/.scripts/rofi/config-selector")
  ("Configfiles"     . "$HOME/.scripts/rofi/configfiles")))
  
(defun find-config-file ()
  "Chooses a config-file from dotfiles and opens it in a new buffer"
  (interactive)
  (ivy-read "Config: " dotfiles
    :action (lambda (confpair) (find-file (substitute-in-file-name (eval (cdr confpair)))))))

(leader-key "fc" '(find-config-file :which-key "find config file"))
#+END_SRC

* Look and Feel
** Theme
doom-theme can be used to set a theme from the doom package
For every other theme, use load-theme

#+BEGIN_SRC emacs-lisp
(use-package monokai-theme
	:config
	(setq monokai-user-variable-pitch t)
	(progn

		(defvar after-load-theme-hook nil
			"Hook run after a color theme is loaded using `load-theme'.")

		(defadvice load-theme (after run-after-load-theme-hook activate)
			"Run `after-load-theme-hook'."
			(run-hooks 'after-load-theme-hook))

		(defun customize-monokai ()
			"Customize monokai theme"
			(if (member 'monokai custom-enabled-themes)
					(custom-theme-set-faces
					 'monokai
					 '(py-object-reference-face ((t (:foreground "#FFA500"))))
					 '(py-decorators-face ((t (:foreground "#FFA500"))))
					 '(py-variable-name-face ((t (:foreground "#FFA500"))))
					 '(py-exception-name-face ((:foreground "#FFA500")))
					 '(py-class-name-face ((:foreground "#FFA500")))
					 '(py-pseudo-keyword-face ((:foreground "#FFA500")))
					 '(py-builtins-face ((:foreground "#FFA500"))))))

		(add-hook 'after-load-theme-hook 'customize-monokai)))

(load-theme 'monokai t)
#+END_SRC

** Centaur-tabs
	 
	#+BEGIN_SRC emacs-lisp
		(use-package centaur-tabs
			:demand
			:config
			(setq
				centaur-tabs-set-icons t
				centaur-tabs-gray-out-icons 'buffer
				centaur-tabs-height 32
				centaur-tabs-set-modified-marker t
				centaur-tabs-modified-marker "•"
				centaur-tabs-set-bar 'under
				x-underline-at-descent-line t
				centaur-tabs-style "wave")
	
			(centaur-tabs-headline-match)
			(centaur-tabs-mode t)
	
			; TODO: configure centaur-tabs-active-bar-face and colors

			:general (leader-key
				"bg" '(centaur-tabs-counsel-switch-group :which-key "choose tab group")
				"b M-p" '(centaur-tabs-backward-group :which-key "previous group")
				"b M-n" '(centaur-tabs-forward-group :which-key "next group")
				"bp" '(centaur-tabs-backward-tab :which-key "previous tab")
				"bn" '(centaur-tabs-forward-tab :which-key "next tab")))
	#+END_SRC
	
#+BEGIN_SRC emacs-lisp
(defun centaur-tabs-hide-tab (x)
  "Do no to show buffer X in tabs."
  (let ((name (format "%s" x)))
    (or
     ;; Current window is not dedicated window.
     (window-dedicated-p (selected-window))

     ;; Buffer name not match below blacklist.
     (string-prefix-p "*epc" name)
     (string-prefix-p "*helm" name)
     (string-prefix-p "*Helm" name)
     (string-prefix-p "*Compile-Log*" name)
     (string-prefix-p "*lsp" name)
     (string-prefix-p "*company" name)
     (string-prefix-p "*Flycheck" name)
     (string-prefix-p "*tramp" name)
     (string-prefix-p " *Mini" name)
     (string-prefix-p "*help" name)
     (string-prefix-p "*straight" name)
     (string-prefix-p " *temp" name)
     (string-prefix-p "*Help" name)
     (string-prefix-p "*mybuf" name)

     ;; Is not magit buffer.
     (and (string-prefix-p "magit" name)
	  (not (file-name-extension name)))
     )))
#+END_SRC
																			 	
