home/programs/emacs/config.org
** Dashboard

#+BEGIN_SRC emacs-lisp
(use-package dashboard
    :init
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t) 

    (setq dashboard-image-banner-max-height (/ (frame-pixel-height) 3))
    (setq dashboard-startup-banner (concat user-emacs-directory "/logo.svg"))
    ; (setq dashboard-startup-banner (concat user-emacs-directory "/logo.svg"))
    (setq dashboard-center-content t)
    (setq dashboard-items '((recents  . 10)
                            (projects . 5)
                            (agenda . 5)
                            (bookmarks . 10)))
    (setq dashboard-projects-switch-function 'counsel-projectile-switch-project-by-name)

    (dashboard-setup-startup-hook)
    
    :custom
    ; (dashboard-banner-logo-title "Execution >> Idea")
    (dashboard-banner-logo-title "Emacs")

    :config
    (set-face-attribute 'dashboard-banner-logo-title nil :font "Droid Sans" :height 300))
#+END_SRC

** Window

#+BEGIN_SRC emacs-lisp
(scroll-bar-mode -1)
(tool-bar-mode -1)
(menu-bar-mode -1)
#+END_SRC

** Editor

#+BEGIN_SRC emacs-lisp
(global-display-line-numbers-mode)
(setq 
  display-line-numbers-type 'relative
  scroll-margin 5)

;; Disable line numbers for some modes
(dolist (mode '(term-mode-hook
                shell-mode-hook
	              treemacs-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))
  


(setq display-line-numbers-type 'relative)
(setq evil-normal-state-cursor '(box "#66d9ef")
      evil-insert-state-cursor '(bar "#a6e22e")
      evil-visual-state-cursor '(hollow "orange"))
#+END_SRC

*** Rainbow parenthesis

#+BEGIN_SRC emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+END_SRC

** Misc

* IDE Tools
** LSP

Setup to activate every time LSP gets activated

Adds the relative path to the project root into the header

#+BEGIN_SRC emacs-lisp
(defun lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode)
  
  (general-nmap
    "gr" 'lsp-find-references
    "gd" 'lsp-find-definition
    "gf" 'find-file-at-point))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package lsp-mode
    :commands (lsp lsp-deferred)

    :hook (
      (lsp-mode . lsp-mode-setup)
      (lsp-mode . lsp-enable-which-key-integration))

    :init (setq
		  lsp-keymap-prefix "C-c l"
      lsp-completion-provider :capf)

    :config (setq
      lsp-inhibit-message t
      lsp-eldoc-render-all nil
      lsp-enable-file-watchers t
      lsp-enable-snippet t
      lsp-enable-symbol-highlighting t
      lsp-headerline-breadcrumb-enable t
      lsp-highlight-symbol-at-point t
      lsp-modeline-code-actions-enable t
      lsp-modeline-diagnostics-enable t

			lsp-ui-doc-position 'right
			lsp-ui-doc-max-height 40
			lsp-ui-doc-enable nil
			lsp-ui-sideline-delay 0.05
			lsp-ui-sideline-show-code-actions nil)
      (lsp-enable-which-key-integration t)
			
			(add-to-list 'company-backends '(company-capf company-dabbrev))

		:bind (
      :map lsp-mode-map 
			("M-RET" . lsp-execute-code-action))

    :general (leader-key
      "l"   (general-simulate-key "C-c l" :which-key "LSP"))

   ([remap xref-find-references] #'lsp-ui-peek-find-references)
   ([remap xref-find-definitions] 'lsp-ui-peek-find-definitions)

		(leader-key
		  "j"  '(:ignore t :which-key "LSP OWN")
			"ja" 'lsp-format-buffer
			"jf" 'lsp-format-buffer
			"jh" 'lsp-describe-thing-at-point
			"jr" 'lsp-restart-workspace
			"jd" 'lsp-goto-implementation
			"jt" 'lsp-goto-type-definition
	    "jx" 'lsp-ui-doc-mode
			"j <f2>" 'lsp-rename)

	 (general-nmap
	   "K" 'lsp-ui-doc-glance))
#+END_SRC

*** lsp-ui
		
All the config for lsp-ui can be found in the lsp block.
This is because lsp automatically loads lsp-ui and any code inside this block will not get executed.
This is only in order to install lsp-ui.

#+BEGIN_SRC emacs-lisp
(use-package lsp-ui)
#+END_SRC

*** lsp-treemacs

Treemacs integration for lsp-mode.
Mainly used in order to see the tree of objects, functions and so on.

#+BEGIN_SRC emacs-lisp
(use-package lsp-treemacs
  :after (lsp treemacs)
  :hook (lsp-mode . lsp-treemacs-sync-mode))
#+END_SRC

*** lsp-ivy

Ivy integration for lsp-mode.
Mainly used in order to choose from the tree of objects, functions and so on.
  
#+BEGIN_SRC emacs-lisp
(use-package lsp-ivy
  :after lsp
  :commands lsp-ivy-workspace-symbol)
#+END_SRC

** Completion

#+BEGIN_SRC emacs-lisp
(use-package company
  :init (setq
    company-idle-delay 0.1          ; show autocompletion after n seconds
    company-async-timeout 15        ; completion may be slow
		company-tooltip-idle-delay 0.1
    company-minimum-prefix-length 1 ; show suggestions after only one character (insted of several)
    company-tooltip-align-annotations t)

  (add-to-list 'company-backends 'company-files)

  :hook (prog-mode . company-mode)

  :bind (("C-RET" . counsel-company)
          :map prog-mode-map
            ("C-i"     . company-indent-or-complete-common)
            ("C-;"     . counsel-company)
            ("C-M-i"   . counsel-company)
          :map company-active-map
            ; ("C-o"     . company-search-kill-others)
            ; ("C-h"     . company-quickhelp-manual-begin)
            ("C-h"     . company-show-doc-buffer)
            ("C-s"     . company-search-candidates)
            ("M-s"     . company-filter-candidates)
            ([C-tab]   . company-complete-common-or-cycle)
            ([tab]     . company-complete-common-or-cycle)
            ([backtab] . company-select-previous)
            ;; ("M-RET"   . company-complete-selection)
            ("RET"     . company-complete-selection)
          :map company-search-map
            ;; ("M-j"     . company-select-next)
            ;; ("M-k"     . company-select-previous)
            ("C-p"     . company-select-next-or-abort)
            ("C-n"     . company-select-previous-or-abort))
            ;; ("C-n" . 'company-search-repeat-forward)
            ;; ("C-p" . 'company-search-repeat-backward)))
            ;; ("<esc>" . (cmd! (company-search-abort) (company-filter-candidates)))))
  :config
    (general-define-key
      "C-SPC" 'company-capf))
#+END_SRC

Nice looking completions

#+BEGIN_SRC elisp
(use-package company-box
  :hook (company-mode . company-box-mode))
#+END_SRC

** Debugging

*** Flycheck mode

#+BEGIN_SRC emacs-lisp
(use-package flycheck
  :config
  (setq
    flycheck-highlighting-mode 'lines)
	
	(set-face-attribute 'flycheck-error nil
                      :family "Fira Code"
											:background "#773131"
                      :weight 'normal
                      :width 'normal)

	(set-face-attribute 'flycheck-warning nil
                      :family "Fira Code"
											:background "#767731"
                      :weight 'normal
                      :width 'normal)
	
  :general (leader-key
    "!"  (general-simulate-key "C-u C-c !" :which-key "Flycheck")))
(global-flycheck-mode 1)
#+END_SRC

** Documentation

#+BEGIN_SRC elisp
#+END_SRC

*** Helpful

#+BEGIN_SRC elisp
(use-package helpful
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
#+END_SRC

