home/programs/emacs/config.el

(use-package projectile
  :init
	(setq projectile-project-search-path '("~/git/"
																					"~/git/temp/"
																					"~/git/appkom/"
																					"~/git/pvv/"))
  (setq projectile-switch-project-action #'projectile-dired)

  :custom ((projectile-completion-system 'ivy))
  :bind-keymap ("C-c p" . projectile-command-map)
  :config (projectile-mode)

  :general (leader-key
        ;; File path
        "fR" 'projectile-recentf
        "fa" 'projectile-ag
        ;; "fyC" 'spacemacs/projectile-copy-file-path-with-line-column
        ;; "fyD" 'spacemacs/projectile-copy-directory-path
        ;; "fyL" 'spacemacs/projectile-copy-file-path-with-line
        ;; "fyY" 'spacemacs/projectile-copy-file-path
        ;; Project
        "p"  '(:ignore t :which-key "projectile")
        "p!" 'projectile-run-shell-command-in-root
        "p&" 'projectile-run-async-shell-command-in-root
        "p%" 'projectile-replace-regexp
        "pa" 'projectile-toggle-between-implementation-and-test
        "pb" 'projectile-switch-to-buffer
        "pc" 'projectile-compile-project
        "pd" 'projectile-find-dir
        "pD" 'projectile-dired
        "pe" 'projectile-edit-dir-locals
        "pf" 'projectile-find-file
        "pF" 'projectile-find-file-dwim
        "pg" 'projectile-find-tag
        "pG" 'projectile-regenerate-tags
        "pI" 'projectile-invalidate-cache
        "pk" 'projectile-kill-buffers
        "pp" 'projectile-switch-project
        "pr" 'projectile-recentf
        "pR" 'projectile-replace
        "pT" 'projectile-test-project
        "pv" 'projectile-vc))

(use-package swiper
  :general (leader-key
	  "s" '(swiper :which-key "search")))

(use-package yasnippet
  :init (yas-global-mode t)
  :config (yas-reload-all)
  :general (leader-key
    "y"  '(:ignore t :which-key "yasnippet")
    "yn" '(yas-new-snippet :which-key "New snippet")
    ;; "yi" '(yas-insert-snippet :which-key "Insert snippet")
    "y/" '(yas-visit-snippet-file :which-key "Find global snippet")
    "yr" '(yas-reload-all :which-key "Reload snippets")
    "yv" '(yas-describe-tables :which-key "View loaded snippets")))

(use-package ivy-yasnippet
  :after yasnippet
  :general (leader-key
    "yi" '(ivy-yasnippet :which-key "Insert snippet")))

(defvar company-mode/enable-yas t
  "Enable yasnippet for all backends.")

(defun company-mode/backend-with-yas (backend)
  (if (or (not company-mode/enable-yas) (and (listp backend) (member 'company-yasnippet backend)))
      backend
    (append (if (consp backend) backend (list backend))
            '(:with company-yasnippet))))

(setq company-backends (mapcar #'company-mode/backend-with-yas company-backends))

(use-package hl-todo
       :ensure t
       :custom-face
       (hl-todo ((t (:inherit hl-todo :italic t))))
       :hook ((prog-mode . hl-todo-mode)
              (yaml-mode . hl-todo-mode)))

(use-package magit
  :general (leader-key
    "g"  '(:ignore t            :which-key "git")
    "g/" '(magit-dispatch       :which-key "Magit dispatch")
    "g." '(magit-file-dispatch  :which-key "Magit file dispatch")
    ;; "g'" '(forge-dispatch       :which-key "Forge dispatch")
    "gg" '(magit-status         :which-key "Magit status")
    "gG" '(magit-status-here    :which-key "Magit status here")
    "gx" '(magit-file-delete    :which-key "Magit file delete")
    "gB" '(magit-blame-addition :which-key "Magit blame")
    "gC" '(magit-clone          :which-key "Magit clone")
    "gF" '(magit-fetch          :which-key "Magit fetch")
    "gL" '(magit-log            :which-key "Magit buffer log")
    "gS" '(magit-stage-file     :which-key "Git stage file")
    "gU" '(magit-unstage-file   :which-key "Git unstage file")

    "gf" '(:ignore t                   :which-key "find")
    "gff" '(magit-find-file            :which-key "Find file")
    "gfg" '(magit-find-git-config-file :which-key "Find gitconfig file")
    "gfc" '(magit-show-commit          :which-key "Find commit")


    "gl" '(:ignore t                 :which-key "list")
    ;; "glg" '(gist-list                :which-key "List gists")
    "glr" '(magit-list-repositories  :which-key "List repositories")
    "gls" '(magit-list-submodules    :which-key "List submodules")
    ;; "gli" '(forge-list-issues        :which-key "List issues")
    ;; "glp" '(forge-list-pullreqs      :which-key "List pull requests")
    ;; "gln" '(forge-list-notifications :which-key "List notifications")

    "gc" '(:ignore t             :which-key "create")
    "gcr" '(magit-init           :which-key "Initialize repo")
    "gcR" '(magit-clone          :which-key "Clone repo")
    "gcc" '(magit-commit-create  :which-key "Commit")
    "gcf" '(magit-commit-fixup   :which-key "Fixup")))
    ;; "gci" '(forge-create-issue   :which-key "Issue")
    ;; "gcp" '(forge-create-pullreq :which-key "Pull request")))

(use-package git-gutter
  :init
  (global-git-gutter-mode 1))

(use-package dart-mode
	:mode "\\.dart\\'")

(use-package lsp-dart
  :hook 'dart-mode-hook)

(use-package elm-mode
  :mode ("\\.elm\\'" . elm-mode)
  :after (company)
  :config (add-to-list 'company-backends 'elm-company)
  
  :general (leader-key elm-mode-map
  
    "mc"  '(:ignore t :which-key "compile")
    "mcb" 'elm-compile-buffer
    "mcm" 'elm-compile-main
    "mct" 'elm-test-project
    "mcr" 'elm-reactor
    "mcb" 'elm-preview-buffer
    "mcp" 'elm-preview-main
     
    "mh"  '(:ignore t :which-key "docs")
    "mhd" 'elm-documentation-lookup
    "mhh" 'elm-oracle-doc-at-point
    "mht" 'elm-oracle-type-at-point
    
    "m."  'elm-repl-load
    "mp"  'elm-repl-push
    "md"  'elm-repl-push-decl
    
    "mi"  'elm-import
    "me"  'elm-expose-at-point
    "ms"  'elm-sort-imports
    "mf"  'elm-format-buffer
    "mv"  'elm-package-catalog))

(use-package flycheck-elm
  :after (flycheck elm-mode)
  :hook (elm-mode-hook . flycheck-elm-setup))

(add-hook 'elm-mode-hook 'lsp)

(use-package highlight-defined
  :config
  (add-hook 'emacs-lisp-mode-hook 'highlight-defined-mode))

(use-package haskell-mode
  :general (leader-key haskell-mode-map

  "mh"  '(haskell-hide-toggle :which-key "hide")
  "mH"  '(haskell-hide-toggle-all :which-key "hide all")

  "mc"  '(:ignore t :which-key "cabal")
  "mcf" '(haskell-cabal-visit-file :which-key "cabal file")
  "mcb" '(haskell-process-cabal-build :which-key "build")))

(use-package hlint-refactor
  :hook (haskell-mode-hook . hlint-refactor-mode)
  :general (leader-key haskell-mode-map
    "mr" '(hlint-refactor-refactor-buffer :which-key "refactor suggestion")))

(use-package hindent
  :hook (haskell-mode-hook . hindent-mode))

(use-package lsp-haskell
  :hook (haskell-mode-hook . lsp)
        (haskell-literate-mode-hook . lsp))
