home/programs/emacs/config.org
** Java

Java LSP using the Eclipse JDT Language server

install jdtls from AUR

#+BEGIN_SRC emacs-lisp
(use-package lsp-java
  :init 
  ; (setq lsp-java-server-install-dir "/usr/share/java/jdtls/")
  (setenv "JAVA_HOME" "/usr/lib/jvm/default")
  (setq
	  lsp-java-java-path (substitute-in-file-name "$JAVA_HOME/bin/java")
		lsp-java-jdt-download-url "https://download.eclipse.org/jdtls/snapshots/jdt-language-server-latest.tar.gz")
  ; :hook (java-mode-hook . lsp)
  :config 
  (add-hook 'java-mode-hook 'flycheck-mode)
  (add-hook 'java-mode-hook 'company-mode)
  (add-hook 'java-mode-hook 'lsp)
	:general (leader-key java-mode-map
		;; LSP Java commands
		"mi" '(lsp-java-organize-imports :which-key "Organize imports")
		"mc" '(lsp-java-build-project    :which-key "Perform partial or full build for the projects")
		;; lsp-java-update-project-configuration - Update project configuration
		;; lsp-java-actionable-notifications - Resolve actionable notifications
		;; lsp-java-update-user-settings - Update user settings (Check the options in the table bellow.)
		;; lsp-java-update-server - Update server instalation.
		"mg"  '(:ignore t :which-key "Generate")
		"mgs" '(lsp-java-generate-to-string            :which-key "Generate toString method")
		"mge" '(lsp-java-generate-equals-and-hash-code :which-key "Generate equals and hashCode methods")
		"mgo" '(lsp-java-generate-overrides            :which-key "Generate method overrides")
		"mgg" '(lsp-java-generate-getters-and-setters  :which-key "Generate getters and setters")
		;; Refactoring
		;; LSP Java provides rich set of refactorings via Eclipse JDT Language Server code actions and some of them are bound to Emacs commands:

		"mr" '(:ignore t :which-key "Refactor")
		"mr" '(lsp-java-extract-to-constant       :which-key "Extract constant refactoring")
		"mr" '(lsp-java-add-unimplemented-methods :which-key "Extract constant refactoring")
		"mr" '(lsp-java-create-parameter          :which-key "Create parameter refactoring")
		"mr" '(lsp-java-create-field              :which-key "Create field refactoring")
		"mr" '(lsp-java-create-local              :which-key "Create local refactoring")
		"mr" '(lsp-java-extract-method            :which-key "Extract method refactoring")
		"mr" '(lsp-java-add-import                :which-key "Add missing import")

		;; Testing support
		"mt"  '(:ignore t :which-key "JUnit")
		"mtr" '(lsp-jt-report-open :which-key "open test report")
		"mtb" '(lsp-jt-browser :which-key "Browse tests and run/debug them.") 
    ;; ^^^ ** Use x to run the test(s) under point; d to debug the tests under point. R to refresh. ** Support for GUI operations.
		"mtl" '(lsp-jt-lens-mode :which-key "test lenses mode")

		;; Dependency viewer
		"md"  '(lsp-java-dependency-list :which-key "View java dependencies")))
#+END_SRC

Maven integration

#+BEGIN_SRC emacs-lisp
  (use-package maven-test-mode
    :hook (java-mode-hook . maven-test-mode)
      ;; (spacemacs/declare-prefix-for-mode 'java-mode "mm" "maven")
      ;; (spacemacs/declare-prefix-for-mode 'java-mode "mmg" "goto")
      ;; (spacemacs/declare-prefix-for-mode 'java-mode "mmt" "tests"))
    ;; :config
    ;; (progn
      ;; (spacemacs|hide-lighter maven-test-mode)
      ;; (spacemacs/set-leader-keys-for-minor-mode 'maven-test-mode
    :general (leader-key maven-test-mode-map
		    "mm"      '(:ignore t :which-key "Maven")
        "mmga"    'maven-test-toggle-between-test-and-class
        "mmgA"    'maven-test-toggle-between-test-and-class-other-window
        "mmta"    'maven-test-all
        "mmt C-a" 'maven-test-clean-test-all
        "mmtb"    'maven-test-file
        "mmti"    'maven-test-install
        "mmtt"    'maven-test-method))
#+END_SRC

#+BEGIN_SRC emacs-lisp

#+END_SRC


malabar-mode 

emacs-eclim ?

** JavaScript / TypeScript

Typescript mode and hook for activating lsp

#+BEGIN_SRC emacs-lisp
(use-package typescript-mode
  :mode "\\.ts\\'"
  :hook (typescript-mode . lsp)
  :config
  (setq typescript-indent-level 2))
#+END_SRC

Install lsp server with

#+BEGIN_SRC bash :tangle no
npm i -g typescript-language-server; npm i -g typescript
#+END_SRC

js2-mode
js-doc
js2-refactor 
npm.el

** Json

#+BEGIN_SRC emacs-lisp
(use-package json-mode
  :mode "\\.js\\(?:on\\|[hl]int\\(?:rc\\)?\\)\\'"
  :hook (json-mode . lsp)
  ; :config
  ; (set-electric! 'json-mode :chars '(?\n ?: ?{ ?}))
  :general (leader-key json-mode-map
    "mp" '(json-mode-show-path :which-key "Copy path")
    "mt" 'json-toggle-boolean
    "md" 'json-mode-kill-path
    "mx" 'json-nullify-sexp
    "m+" 'json-increment-number-at-point
    "m-" 'json-decrement-number-at-point
    "mf" 'json-mode-beautify))
#+END_SRC

(use-package! counsel-jq
  :when (featurep! :completion ivy)
  :defer t
  :init
  (map! :after json-mode
        :map json-mode-map
        :localleader
        "s" #'counsel-jq))

