home/programs/emacs/config.org
** Comment Utils

Make a header comment using the [[https://github.com/cacalabs/toilet][toilet]] utility with the font pagga

░█▀█░█▀█░█▀▀░█▀▀░█▀█
░█▀▀░█▀█░█░█░█░█░█▀█
░▀░░░▀░▀░▀▀▀░▀▀▀░▀░▀

#+BEGIN_SRC emacs-lisp
(defun header_comment ()
  "Function to make a header comment"
    (interactive)
    (save-excursion
      (let (start end commentString)
        (setq start (line-beginning-position) )
        (setq end   (line-end-position) )
        (setq commentString (thing-at-point 'line) )

        (delete-region start end)
        (insert
         (concat
          (cdr (call-process "toilet" nil t nil "-f" "pagga" commentString)) "\n"
           commentString))
        (comment-region start (line-end-position))
        )))

(leader-key
  "ic" '(header_comment :which-key "header comment"))
#+END_SRC

** Other

#+BEGIN_SRC emacs-lisp
;; (use-package! flycheck-popup-tip
;;   :config (flycheck-popup-tip-error-prefix "E -> "))
;; 
;; (defun scroll-error-up ()
;;   (interactive)
;;   (message (prin1-to-string flycheck-popup-tip-object))
;;   (popup-scroll-up flycheck-popup-tip-object))
;; 
;; (defun scroll-error-down ()
;;   (interactive)
;;   (popup-scroll-down flycheck-popup-tip-object))


;; (map!
;;  (:after flycheck-popup-tip
;;    :en "C-j"   #'scroll-error-down
;;    :en "C-k"   #'scroll-error-up))

#+END_SRC
* Sources
** Articles

https://protesilaos.com/

https://writequit.org/denver-emacs/presentations/2017-04-11-ivy.html

https://robert.kra.hn/posts/2021-02-07_rust-with-emacs/

** Configs
*** Quinoa42

https://quinoa42.github.io/en/dot-emacs/

*** Yang Haoxie

Evil escape mode

https://github.com/yanghaoxie/emacs.d

*** Rohit Goswami

Anki, viewnior, PKGBUILD mode, Docker-mode

https://dotdoom.rgoswami.me/config.html

** Distributions

Dots and pieces (especially language-specific package configs) were taken from spacemacs and doom

Doom bindings: https://github.com/hlissner/doom-emacs/blob/develop/modules/config/default/%2Bemacs-bindings.el
        (evil) https://github.com/hlissner/doom-emacs/blob/develop/modules/editor/evil/config.el
               https://github.com/hlissner/doom-emacs/blob/develop/modules/config/default/%2Bevil-bindings.el

** Youtube
	 
*** System crafters
Most of the config is made with great help from a video series made by System Crafters called "Emacs from Scratch"
Config: https://github.com/daviwil/emacs-from-scratch

*** Matheus Augusto da Silva
Several configuration options and explanations was given by Matheus Augusto da Silva

*** Uncle Dave
*** Talks

The Spacemacs based way of handling shortcuts was made with help from a talk by Suyash Bire
https://www.youtube.com/watch?v=6INMXmsCCC8
https://github.com/suyashbire1/emacs.d/blob/master/init.el

* TODO: [0/6]

*** Prioritized [1/5]
  - [-] IDE stuff [3/5]
    - [ ] magit [0/1]
		  - [ ] evil keybindings
    - [-] company-mode [2/6]
		  - [X] LSP integration
		  - [X] open on CTRL-SPC
		  - [ ] scroll with M-[jk]
		  - [ ] close on enter	
	    - [ ] Path autocompletion company
	    - [ ] Yasnippets in company
    - [X] helpful
    - [X] projectile
    - [X] flycheck
  - [-] Add several bindings [2/9]
    - [ ] counsel
    - [ ] swiper
    - [ ] pdf tools
    - [ ] LaTeX
    - [ ] org
    - [ ] treemacs
    - [X] look through doom
    - [ ] look through spacemacs
    - [X] emacs control [4/4]
      - [X] windows
      - [X] quit
      - [X] files
      - [X] config files
  - [-] LaTeX config [3/6]
    - [X] synctex (zathura or pdf-tools)
    - [ ] preview math
    - [X] conceal levels (prettify-symbols)
    - [X] snippets
    - [ ] bibtex [0/1]
			- [ ] set up reftex
    - [ ] Castel like way of opening geogebra/inkscape
  - [X] Shortcut to config files
	- [ ] Add toggler for menubar

*** Fix LSP mode [1/4]
  - [X] Fix LSP UI
  - [ ] Fix LSP UI bindings [0/8]
    - [ ] toggle doc mode
    - [ ] scroll in doc mode
    - [ ] toggle sideline [0/3]
      - [ ] diagnostics
      - [ ] hover
      - [ ] code-actions
    - [ ] toggle flycheckers
    - [ ] toggle breadcrumb
    - [ ] peek-definitions
    - [ ] peek-references
    - [ ] lsp-ui-imenu 
  - [-] Fix some languages [3/8]
    - [X] Elm
    - [X] Java
    - [X] Python
    - [ ] Haskell
    - [ ] Dart / Flutter
    - [ ] C / C++
    - [ ] Yaml
    - [ ] Json
  - [ ] Toggle error modes in flycheck (warnings, suggestions, errors, ...)
      
*** Research [1/2]
  - [-] Research org mode [3/5]
    - [X] How to add agenda entries
    - [ ] Vimwiki like stuff?
    - [X] Project specific todo-lists?
        I'm planning on making a folder in ~/org called notes which hosts the relative paths to all project folders (as in "~/git/project" -> "~/org/notes/git/project.org")

    - [ ] Links and images?
    - [X] SRC block shortcut -> C-c C-,
  - [X] Research yasnippets [2/2]
    - [X] How to add language specific snippets?
    - [X] Snippet format
    
*** Smaller tasks [1/9]
	- [ ] remove star buffers from tab line -> https://www.emacswiki.org/emacs/TabBarMode
	- [ ] make :q close a window [delete-window] whenever there is more than one window (except treemacs)
  - [ ] solve drag mode in org mode (conflict with evil-org dragging)
  - [-] Dired / *messages*  leader-key usage
		- [ ] Dired
		- [X] *messages*
  - [ ] Fix esc key
  - [ ] ag-search-file
  - [X] Lambda conceal
	- [ ] remove collision between fira-code-mode and prettify-symbols
	- [ ] disable next-buffer/pre in treemacs-mode-map (if exists?) 
    
*** Less Prioritized [1/10]
  - [X] Make a nice dashboard
  - [ ] Customize dashboard-heading face size (and maybe font type?)
  - [ ] Customize dashboard-item placement (logo in middle, items on sides)
  - [ ] Add "go to previous file" type of function (instead of C-o)
  - [ ] Add borders to zen mode
  - [ ] Edit modeline items?
  - [ ] Emoji
  - [ ] Unicode
  - [ ] Add images to plugin descriptions
  - [ ] Add Japanese support [0/2]
    - [ ] DDSKK
    - [ ] pangu-spacing

*** Set up packages [0/12]
  - [ ] popup
  - [ ] magit-popup
  - [ ] gitignore-mode
  - [ ] dotenv-mode
  - [ ] smooth-scrolling
  - [ ] gist
  - [ ] docker
  - [ ] treemacs-magit?
  - [ ] move-text vs dragstuff
  - [ ] visual-regexp - Replace via RegExp, with real-time visual feedback directly in the buffer.
  - [ ] visual-regexp-steroids - The same as visual-regexp, but use modern regular expressions instead of Emacs-style.
  - [ ] From doom [0/9]
    - [ ] ligatures
    - [ ] ophints?
    - [ ] unicode
    - [ ] fold
    - [ ] word-wrapping (soft wordwrap indent)
    - [ ] vc-gutter (+ or - on the side of the code based on git status)
    - [ ] electric ?
    - [ ] editorconfig ?
    - [ ] lookup


;; Local Variables: 
;; eval: (add-hook 'after-save-hook (lambda ()(if (y-or-n-p "Reload?")(load-file user-init-file))) nil t) 
;; eval: (add-hook 'after-save-hook (lambda ()(if (y-or-n-p "Tangle?")(org-babel-tangle))) nil t) 
;; End:
